## 문제1

In [ ]:
결측값을 보간처리하여 임의의 값으로 처리하시오

In [245]:
import numpy as np

In [247]:
s = pd.Series([0, 3, np.nan, 12, np.nan, 10])

In [248]:
s.interpolate()

0     0.0
1     3.0
2     7.5
3    12.0
4    11.0
5    10.0
dtype: float64

## 문제2

In [ ]:
결측값을 생성해서 NaN값을 채우시오(1.앞행, 2.뒤행, 3,평균값)

In [76]:
import pandas as pd

In [77]:
df = pd.DataFrame({"v1":[None,200,None,400], "v2":[None,200,100,250], "v3":[40,60,500,700]})

In [78]:
df

      v1     v2   v3
0    NaN    NaN   40
1  200.0  200.0   60
2    NaN  100.0  500
3  400.0  250.0  700

In [79]:
df.fillna(0)

      v1     v2   v3
0    0.0    0.0   40
1  200.0  200.0   60
2    0.0  100.0  500
3  400.0  250.0  700

In [80]:
df.fillna(method='ffill')	# 앞 행의 값으로 결측치 채우기

      v1     v2   v3
0    NaN    NaN   40
1  200.0  200.0   60
2  200.0  100.0  500
3  400.0  250.0  700

In [81]:
df.fillna(method='bfill')	# 뒤 행의 값으로 결측치 채우기

      v1     v2   v3
0  200.0  200.0   40
1  200.0  200.0   60
2  400.0  100.0  500
3  400.0  250.0  700

In [82]:
df.fillna(df.mean())	# 각 열의 평균 값으로 결측치 채우기

      v1          v2   v3
0  300.0  183.333333   40
1  200.0  200.000000   60
2  300.0  100.000000  500
3  400.0  250.000000  700

## 문제 3

In [ ]:
엑셀파일 school_major을 불러와서 
1.중복 데이터의 첫번째 자료를 남기고 제거하시오.
2.이어서 두번째 자료를 남기고 제거하시오.

In [118]:
import pandas as pd

In [119]:
import os

In [126]:
df = pd.read_excel('data/school_major.xls')

In [130]:
df

    name             major     sex
0   John  Computer Science    male
1   Nate  Computer Science    male
2  Wendy         Economics  Female
3   Nate        Psychology  Female
4   John  Computer Science    male

In [249]:
df.duplicated().sum()

1

In [252]:
df['name'].duplicated().head()

0    False
1    False
2    False
3     True
4     True
Name: name, dtype: bool

In [253]:
df_dup=df.copy()

In [255]:
df_dup

    name             major     sex
0   John  Computer Science    male
1   Nate  Computer Science    male
2  Wendy         Economics  Female
3   Nate        Psychology  Female
4   John  Computer Science    male

In [132]:
#중복제거시 첫번째를 살림(default)
df.drop_duplicates()

    name             major     sex
0   John  Computer Science    male
1   Nate  Computer Science    male
2  Wendy         Economics  Female
3   Nate        Psychology  Female

In [135]:
df.drop_duplicates(keep='last')

    name             major     sex
1   Nate  Computer Science    male
2  Wendy         Economics  Female
3   Nate        Psychology  Female
4   John  Computer Science    male